<?php

return [
    'sign_in' => 'Войти',
    'go_to_login' => 'Перейти к входу',
    'failed' => 'Не удалось найти аккаунт с указанными учетными данными.',

    'forgot_password' => [
        'label' => 'Забыли пароль?',
        'label_help' => 'Введите адрес электронной почты вашего аккаунта, чтобы получить инструкции по сбросу пароля.',
        'button' => 'Восстановить аккаунт',
    ],

    'reset_password' => [
        'button' => 'Сбросить и войти',
    ],

    'two_factor' => [
        'label' => 'Токен 2-Факторной Аутентификации',
        'label_help' => 'Для продолжения требуется второй уровень аутентификации. Пожалуйста, введите код, сгенерированный вашим устройством, чтобы завершить вход.',
        'checkpoint_failed' => 'Токен двухфакторной аутентификации неверен.',
    ],

    'throttle' => 'Слишком много попыток входа. Попробуйте снова через :seconds секунд.',
    'password_requirements' => 'Пароль должен содержать не менее 8 символов и быть уникальным для этого сайта.',
    '2fa_must_be_enabled' => 'Администратор потребовал включение двухфакторной аутентификации для вашего аккаунта, чтобы использовать Панель.',
];
