<?php

return [
    'daemon_connection_failed' => 'Произошло исключение при попытке связи с демоном, что привело к HTTP/:code коду ответа. Это исключение было зафиксировано в журнале.',
    'node' => [
        'servers_attached' => 'У узла не должно быть связанных серверов для его удаления.',
        'daemon_off_config_updated' => 'Конфигурация демона <strong>была обновлена</strong>, однако при попытке автоматически обновить конфигурационный файл на Демоне произошла ошибка. Вам нужно будет вручную обновить конфигурационный файл (config.yml), чтобы применить эти изменения.',
    ],
    'allocations' => [
        'server_using' => 'В настоящее время сервер назначен на это распределение. Распределение можно удалить только в случае, если сервер не назначен.',
        'too_many_ports' => 'Добавление более 1000 портов в одном диапазоне сразу не поддерживается.',
        'invalid_mapping' => 'Предоставленное сопоставление для :port было неверным и не может быть обработано.',
        'cidr_out_of_range' => 'Обозначение CIDR допускает только маски от /25 до /32.',
        'port_out_of_range' => 'Порты в распределении должны быть больше 1024 и меньше или равны 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'Гнездо с активными серверами, прикрепленными к нему, не может быть удалено из панели.',
        'egg' => [
            'delete_has_servers' => 'Яйцо с активными серверами, прикрепленными к нему, не может быть удалено из панели.',
            'invalid_copy_id' => 'Выбранное яйцо для копирования скрипта либо не существует, либо является копированием самого скрипта.',
            'must_be_child' => 'Директива "Копировать настройки из" для этого яйца должна быть дочерним вариантом для выбранного гнезда.',
            'has_children' => 'Это яйцо является родителем для одного или нескольких других яиц. Пожалуйста, удалите эти яйца перед удалением этого яйца.',
        ],
        'variables' => [
            'env_not_unique' => 'Переменная окружения :name должна быть уникальной для этого яйца.',
            'reserved_name' => 'Переменная окружения :name защищена и не может быть назначена переменной.',
            'bad_validation_rule' => 'Правило валидации ":rule" не является допустимым правилом для этого приложения.',
        ],
        'importer' => [
            'json_error' => 'Произошла ошибка при попытке разобрать JSON файл: :error.',
            'file_error' => 'Предоставленный JSON файл был недействительным.',
            'invalid_json_provided' => 'Предоставленный JSON файл не в формате, который может быть распознан.',
        ],
    ],
    'subusers' => [
        'editing_self' => 'Редактирование своего собственного аккаунта субпользователя не разрешено.',
        'user_is_owner' => 'Вы не можете добавить владельца сервера как субпользователя для этого сервера.',
        'subuser_exists' => 'Пользователь с таким адресом электронной почты уже назначен как субпользователь для этого сервера.',
    ],
    'databases' => [
        'delete_has_databases' => 'Невозможно удалить сервер хоста базы данных, к которому привязаны активные базы данных.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максимальное время интервала для связанной задачи составляет 15 минут.',
    ],
    'locations' => [
        'has_nodes' => 'Невозможно удалить местоположение, к которому прикреплены активные узлы.',
    ],
    'users' => [
        'node_revocation_failed' => 'Не удалось аннулировать ключи на <a href=":link">Узел #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Не найдено узлов, соответствующих требованиям для автоматического развертывания.',
        'no_viable_allocations' => 'Не найдено распределений, удовлетворяющих требованиям для автоматического развертывания.',
    ],
    'api' => [
        'resource_not_found' => 'Запрашиваемый ресурс не существует на этом сервере.',
    ],
];
