<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые строки пагинации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются библиотекой пагинатора для создания
    | простых ссылок на страницы. Вы можете изменить их на любые другие
    | строки, чтобы лучше настроить ваши представления в соответствии с вашим приложением.
    |
    */

    'previous' => '&laquo; Назад',
    'next' => 'Вперед &raquo;',
];
