<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые строки сброса пароля
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки являются стандартными строками, которые соответствуют причинам,
    | указанным брокером паролей для попытки обновления пароля,
    | если она не удалась, например, из-за недействительного токена или неправильного нового пароля.
    |
    */
    'password' => 'Пароли должны содержать не менее шести символов и совпадать с подтверждением.',
    'reset' => 'Ваш пароль был сброшен!',
    'sent' => 'Мы отправили вам ссылку для сброса пароля на электронную почту!',
    'token' => 'Этот токен для сброса пароля недействителен.',
    'user' => 'Не удалось найти пользователя с таким адресом электронной почты.',
];
