<?php

return [
    'email' => [
        'title' => 'Обновите свой адрес электронной почты',
        'updated' => 'Ваш адрес электронной почты был обновлён.',
    ],
    'password' => [
        'title' => 'Измените свой пароль',
        'requirements' => 'Ваш новый пароль должен содержать не менее 8 символов.',
        'updated' => 'Ваш пароль был обновлён.',
    ],
    'two_factor' => [
        'button' => 'Настроить двухфакторную аутентификацию',
        'disabled' => 'Двухфакторная аутентификация была отключена для вашего аккаунта. Вам больше не нужно будет вводить токен при входе.',
        'enabled' => 'Двухфакторная аутентификация была включена для вашего аккаунта! Теперь при входе вам нужно будет предоставить код, сгенерированный вашим устройством.',
        'invalid' => 'Предоставленный токен недействителен.',
        'setup' => [
            'title' => 'Настройка двухфакторной аутентификации',
            'help' => 'Не удаётся отсканировать код? Введите код ниже в ваше приложение:',
            'field' => 'Введите токен',
        ],
        'disable' => [
            'title' => 'Отключить двухфакторную аутентификацию',
            'field' => 'Введите токен',
        ],
    ],
];
