<?php

return [
    'location' => [
        'no_location_found' => 'Не удалось найти запись, соответствующую предоставленному краткому коду.',
        'ask_short' => 'Краткий код местоположения',
        'ask_long' => 'Описание местоположения',
        'created' => 'Новоё местоположение (:name) с ID :id успешно создано.',
        'deleted' => 'Запрашиваемое местоположение успешно удалено.',
    ],
    'user' => [
        'search_users' => 'Введите имя пользователя, ID пользователя или адрес электронной почты',
        'select_search_user' => 'ID пользователя для удаления (введите \'0\' для нового поиска)',
        'deleted' => 'Пользователь успешно удалён из панели.',
        'confirm_delete' => 'Вы уверены, что хотите удалить этого пользователя из панели?',
        'no_users_found' => 'Пользователи по указанному запросу не найдены.',
        'multiple_found' => 'Найдено несколько аккаунтов для указанного пользователя, удалить пользователя невозможно из-за флага --no-interaction.',
        'ask_admin' => 'Является ли этот пользователь администратором?',
        'ask_email' => 'Адрес электронной почты',
        'ask_username' => 'Имя пользователя',
        'ask_name_first' => 'Имя',
        'ask_name_last' => 'Фамилия',
        'ask_password' => 'Пароль',
        'ask_password_tip' => 'Если вы хотите создать аккаунт с случайным паролем, отправленным пользователю на почту, повторите эту команду (CTRL+C) и добавьте флаг `--no-password`.',
        'ask_password_help' => 'Пароли должны содержать не менее 8 символов и включать хотя бы одну заглавную букву и цифру.',
        '2fa_help_text' => [
            'Эта команда отключит двухфакторную аутентификацию для аккаунта пользователя, если она включена. Используйте эту команду только для восстановления доступа к аккаунту, если пользователь не может войти.',
            'Если вы не собирались выполнять эту операцию, нажмите CTRL+C для выхода из процесса.',
        ],
        '2fa_disabled' => 'Двухфакторная аутентификация была отключена для :email.',
    ],
    'schedule' => [
        'output_line' => 'Запуск задания для первой задачи в `:schedule` (:hash).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Удаление резервной копии сервиса :file.',
    ],
    'server' => [
        'rebuild_failed' => 'Запрос на пересборку для ":name" (#:id) на узле ":node" завершился ошибкой: :message',
        'reinstall' => [
            'failed' => 'Запрос на переустановку для ":name" (#:id) на узле ":node" завершился ошибкой: :message',
            'confirm' => 'Вы собираетесь переустановить группу серверов. Хотите продолжить?',
        ],
        'power' => [
            'confirm' => 'Вы собираетесь выполнить действие :action для :count серверов. Хотите продолжить?',
            'action_failed' => 'Запрос на действие по питанию для ":name" (#:id) на узле ":node" завершился ошибкой: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP Хост (например, smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP Порт',
            'ask_smtp_username' => 'SMTP Имя пользователя',
            'ask_smtp_password' => 'SMTP Пароль',
            'ask_mailgun_domain' => 'Домен Mailgun',
            'ask_mailgun_endpoint' => 'Точка подключения Mailgun',
            'ask_mailgun_secret' => 'Секрет Mailgun',
            'ask_mandrill_secret' => 'Секрет Mandrill',
            'ask_postmark_username' => 'API-ключ Postmark',
            'ask_driver' => 'Какой драйвер следует использовать для отправки электронных писем?',
            'ask_mail_from' => 'Адрес электронной почты, с которого будут отправляться письма',
            'ask_mail_name' => 'Имя, от которого будут отправляться письма',
            'ask_encryption' => 'Метод шифрования для использования',
        ],
    ],
];
