<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'Предоставленный FQDN или IP-адрес не разрешается в действительный IP-адрес.',
        'fqdn_required_for_ssl' => 'Необходимо полностью квалифицированное доменное имя, которое разрешается в публичный IP-адрес, для использования SSL на этом узле.',
    ],
    'notices' => [
        'allocations_added' => 'Выделенные ресурсы успешно добавлены на этот узел.',
        'node_deleted' => 'Узел успешно удалён из панели.',
        'location_required' => 'Необходимо настроить хотя бы одно местоположение перед добавлением узла в панель.',
        'node_created' => 'Новый узел успешно создан. Вы можете автоматически настроить демон на этом компьютере, перейдя на вкладку "Конфигурация". <strong>Прежде чем добавлять серверы, необходимо сначала выделить хотя бы один IP-адрес и порт.</strong>',
        'node_updated' => 'Информация об узле обновлена. Если были изменены настройки демона, его нужно перезагрузить, чтобы изменения вступили в силу.',
        'unallocated_deleted' => 'Удалены все невыделенные порты для <code>:ip</code>.',
    ],
];
