<?php

return [
    'exceptions' => [
        'no_new_default_allocation' => 'Вы пытаетесь удалить стандартное распределение для этого сервера, но нет резервного распределения для использования.',
        'marked_as_failed' => 'Этот сервер был отмечен как неудачный при предыдущей установке. Текущий статус не может быть изменён в этом состоянии.',
        'bad_variable' => 'Произошла ошибка проверки переменной :name.',
        'daemon_exception' => 'Произошло исключение при попытке связи с демоном, в результате чего был получен HTTP/:code код ответа. Это исключение было зафиксировано в журнале. (идентификатор запроса: :request_id)',
        'default_allocation_not_found' => 'Запрашиваемое стандартное распределение не найдено среди распределений этого сервера.',
    ],
    'alerts' => [
        'startup_changed' => 'Конфигурация запуска для этого сервера была обновлена. Если гнездо или яйцо этого сервера были изменены, переустановка будет выполнена сейчас.',
        'server_deleted' => 'Сервер успешно удалён из системы.',
        'server_created' => 'Сервер успешно создан в панели. Пожалуйста, подождите несколько минут, пока демон полностью установит этот сервер.',
        'build_updated' => 'Детали сборки для этого сервера были обновлены. Некоторые изменения могут потребовать перезагрузки для вступления в силу.',
        'suspension_toggled' => 'Статус приостановки сервера был изменён на :status.',
        'rebuild_on_boot' => 'Этот сервер был помечен как требующий пересборки Docker контейнера. Это произойдет при следующем запуске сервера.',
        'install_toggled' => 'Статус установки для этого сервера был изменён.',
        'server_reinstalled' => 'Этот сервер был поставлен в очередь на переустановку, которая начнётся сейчас.',
        'details_updated' => 'Детали сервера успешно обновлены.',
        'docker_image_updated' => 'Стандартное изображение Docker для этого сервера успешно изменено. Для применения изменения требуется перезагрузка.',
        'node_required' => 'Необходимо настроить хотя бы один узел перед добавлением сервера в панель.',
        'transfer_nodes_required' => 'Необходимо настроить хотя бы два узла перед переносом серверов.',
        'transfer_started' => 'Перенос сервера начат.',
        'transfer_not_viable' => 'Выбранный узел не имеет необходимого объема дискового пространства или памяти для размещения этого сервера.',
    ],
];
